Table of Contents
 Interface IConnectionAutomation
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
[ServiceContract]
public interface IConnectionAutomation
Methods
 GenerateReport(int, ConnReportSettings)
Generate a report of the connection conId
string GenerateReport(int conId, ConnReportSettings settings)
Parameters
conId int
Id of the required connection
settings ConnReportSettings
Report settings
Returns
string
The identifier of a generated report
 GetProjectInfo()
ConProjectInfo GetProjectInfo()
Returns
ConProjectInfo
 Edit this page